{"format": "graph-model", "generatedBy": "2.1.0", "convertedBy": "TensorFlow.js Converter v1.4.0", "userDefinedMetadata": {"signature": {"inputs": {"po_1:0": {"name": "po_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "259"}]}}, "c0_1:0": {"name": "c0_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}]}}, "h0_0:0": {"name": "h0_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}]}}, "seq:0": {"name": "seq:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "3"}]}}, "pz_0:0": {"name": "pz_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "3"}]}}, "po_0:0": {"name": "po_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "3"}]}}, "pf_1:0": {"name": "pf_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "259"}]}}, "c0_0:0": {"name": "c0_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}]}}, "h0_1:0": {"name": "h0_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}]}}, "pz_1:0": {"name": "pz_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "259"}]}}, "pf_0:0": {"name": "pf_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "3"}]}}}, "outputs": {"Identity_7:0": {"name": "Identity_7:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "259"}]}}, "Identity_10:0": {"name": "Identity_10:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}]}}, "Identity_9:0": {"name": "Identity_9:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}]}}, "Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "3"}]}}, "Identity_4:0": {"name": "Identity_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}]}}, "Identity_6:0": {"name": "Identity_6:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "259"}]}}, "Identity_8:0": {"name": "Identity_8:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "259"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "3"}]}}, "Identity_3:0": {"name": "Identity_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "3"}]}}, "Identity_5:0": {"name": "Identity_5:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}]}}, "Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "-1"}]}}}}}, "modelTopology": {"node": [{"name": "po_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "c0_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}]}}}}, {"name": "h0_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}]}}}}, {"name": "pz_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "259"}]}}}}, {"name": "po_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "259"}]}}}}, {"name": "pf_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "259"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pf_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "c0_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "h0_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pz_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "seq", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input_control_node/_0", "op": "NoOp", "input": ["^c0_0", "^c0_1", "^h0_0", "^h0_1", "^pf_0", "^pf_1", "^po_0", "^po_1", "^pz_0", "^pz_1", "^seq"]}, {"name": "StatefulPartitionedCall/model/mixture_coef/mul/x", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_5/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_2/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_1", "op": "Identity", "input": ["seq", "^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/concat/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "3"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_2/moments/mean/reduction_indices", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_2/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_2/add_1/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_1/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "3"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_1/add_1/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/fopool_0/sub/x", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "3"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization/add_1/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_5/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "259"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_5/add_1/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_4/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "259"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_4/add_1/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_3/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_3/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "259"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_3/add_1/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/free", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/axes", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/concat/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "515"}, {"size": "193"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Const_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "193"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mixture_coef/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/mixture_coef/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/mixture_coef/floordiv/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/mixture_coef/split/split_dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/mixture_coef/clip_by_value/Minimum/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mixture_coef/clip_by_value/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/mixture_coef/clip_by_value_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/mixture_coef/clip_by_value_2/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/concat", "op": "ConcatV2", "input": ["po_0", "Func/StatefulPartitionedCall/input/_1", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/concat", "op": "ConcatV2", "input": ["pf_0", "Func/StatefulPartitionedCall/input/_1", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/fopool_0/ExpandDims", "op": "ExpandDims", "input": ["c0_0", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/concat/axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/concat", "op": "ConcatV2", "input": ["pz_0", "Func/StatefulPartitionedCall/input/_1", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/fopool_1/ExpandDims", "op": "ExpandDims", "input": ["c0_1", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/output_control_node/_43", "op": "NoOp", "input": ["^StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/dense/Tensordot/ReadVariableOp", "^StatefulPartitionedCall/model/qrnn_0/normalization/ReadVariableOp", "^StatefulPartitionedCall/model/qrnn_0/normalization/add_1/ReadVariableOp", "^StatefulPartitionedCall/model/qrnn_0/normalization_1/ReadVariableOp", "^StatefulPartitionedCall/model/qrnn_0/normalization_1/add_1/ReadVariableOp", "^StatefulPartitionedCall/model/qrnn_0/normalization_2/ReadVariableOp", "^StatefulPartitionedCall/model/qrnn_0/normalization_2/add_1/ReadVariableOp", "^StatefulPartitionedCall/model/qrnn_1/normalization_3/ReadVariableOp", "^StatefulPartitionedCall/model/qrnn_1/normalization_3/add_1/ReadVariableOp", "^StatefulPartitionedCall/model/qrnn_1/normalization_4/ReadVariableOp", "^StatefulPartitionedCall/model/qrnn_1/normalization_4/add_1/ReadVariableOp", "^StatefulPartitionedCall/model/qrnn_1/normalization_5/ReadVariableOp", "^StatefulPartitionedCall/model/qrnn_1/normalization_5/add_1/ReadVariableOp"]}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/concat", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/concat/axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/concat", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/strided_slice/stack", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/strided_slice/stack_1", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/concat", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/concat/axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/concat", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/strided_slice/stack", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/strided_slice/stack_1", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/concat", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/concat", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/strided_slice/stack", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/strided_slice/stack_1", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "5"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/conv1d", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/conv1d/ExpandDims", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "Identity_3", "op": "Identity", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/strided_slice", "^Func/StatefulPartitionedCall/output_control_node/_43"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/conv1d", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/conv1d/ExpandDims", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "Identity_2", "op": "Identity", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/strided_slice", "^Func/StatefulPartitionedCall/output_control_node/_43"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/conv1d", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/conv1d/ExpandDims", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/strided_slice", "^Func/StatefulPartitionedCall/output_control_node/_43"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/conv1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/conv1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/conv1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_2/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/conv1d/Squeeze", "StatefulPartitionedCall/model/qrnn_0/normalization_2/moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_1/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/conv1d/Squeeze", "StatefulPartitionedCall/model/qrnn_0/normalization_2/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/conv1d/Squeeze", "StatefulPartitionedCall/model/qrnn_0/normalization_2/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_2/sub", "op": "Sub", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/conv1d/Squeeze", "StatefulPartitionedCall/model/qrnn_0/normalization_2/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_2/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization_2/moments/mean", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/conv1d/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_1/sub", "op": "Sub", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/conv1d/Squeeze", "StatefulPartitionedCall/model/qrnn_0/normalization_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_1/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization_1/moments/mean", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/conv1d/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization/sub", "op": "Sub", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/conv1d/Squeeze", "StatefulPartitionedCall/model/qrnn_0/normalization/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization/moments/mean", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/conv1d/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_2/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization_2/moments/SquaredDifference", "StatefulPartitionedCall/model/qrnn_0/normalization_2/moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_1/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization_1/moments/SquaredDifference", "StatefulPartitionedCall/model/qrnn_0/normalization_2/moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization/moments/SquaredDifference", "StatefulPartitionedCall/model/qrnn_0/normalization_2/moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_2/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization_2/add/y", "StatefulPartitionedCall/model/qrnn_0/normalization_2/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization_1/moments/variance", "StatefulPartitionedCall/model/qrnn_0/normalization_2/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization/moments/variance", "StatefulPartitionedCall/model/qrnn_0/normalization_2/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_2/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_1/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_2/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization_2/ReadVariableOp", "StatefulPartitionedCall/model/qrnn_0/normalization_2/Sqrt"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_1/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization_1/ReadVariableOp", "StatefulPartitionedCall/model/qrnn_0/normalization_1/Sqrt"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization/ReadVariableOp", "StatefulPartitionedCall/model/qrnn_0/normalization/Sqrt"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_2/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization_2/sub", "StatefulPartitionedCall/model/qrnn_0/normalization_2/truediv"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization_1/sub", "StatefulPartitionedCall/model/qrnn_0/normalization_1/truediv"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization/sub", "StatefulPartitionedCall/model/qrnn_0/normalization/truediv"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_2/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization_2/add_1/ReadVariableOp", "StatefulPartitionedCall/model/qrnn_0/normalization_2/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization_1/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization_1/add_1/ReadVariableOp", "StatefulPartitionedCall/model/qrnn_0/normalization_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/normalization/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization/add_1/ReadVariableOp", "StatefulPartitionedCall/model/qrnn_0/normalization/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization_2/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/fopool_0/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/Sigmoid", "StatefulPartitionedCall/model/qrnn_0/fopool_0/ExpandDims"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/fopool_0/sub", "op": "Sub", "input": ["StatefulPartitionedCall/model/qrnn_0/fopool_0/sub/x", "StatefulPartitionedCall/model/qrnn_0/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/fopool_0/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/Tanh", "StatefulPartitionedCall/model/qrnn_0/fopool_0/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/fopool_0/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/qrnn_0/fopool_0/mul", "StatefulPartitionedCall/model/qrnn_0/fopool_0/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/fopool_0/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/Sigmoid_1", "StatefulPartitionedCall/model/qrnn_0/fopool_0/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/fopool_0/Squeeze_1", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/qrnn_0/fopool_0/add"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/fopool_0/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/qrnn_0/fopool_0/mul_2"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/concatenate_0/concat", "op": "ConcatV2", "input": ["Func/StatefulPartitionedCall/input/_1", "StatefulPartitionedCall/model/qrnn_0/fopool_0/mul_2", "StatefulPartitionedCall/model/mixture_coef/mul/x"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "Identity_5", "op": "Identity", "input": ["StatefulPartitionedCall/model/qrnn_0/fopool_0/Squeeze_1", "^Func/StatefulPartitionedCall/output_control_node/_43"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_4", "op": "Identity", "input": ["StatefulPartitionedCall/model/qrnn_0/fopool_0/Squeeze", "^Func/StatefulPartitionedCall/output_control_node/_43"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_5/concat", "op": "ConcatV2", "input": ["po_1", "StatefulPartitionedCall/model/concatenate_0/concat", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/concat", "op": "ConcatV2", "input": ["pf_1", "StatefulPartitionedCall/model/concatenate_0/concat", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_3/concat", "op": "ConcatV2", "input": ["pz_1", "StatefulPartitionedCall/model/concatenate_0/concat", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_5/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_5/concat", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_5/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_5/concat", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/strided_slice/stack", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/strided_slice/stack_1", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/strided_slice/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/concat", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/concat/axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/concat", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/strided_slice/stack", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/strided_slice/stack_1", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_3/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_3/concat", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_3/concat", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/strided_slice/stack", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/strided_slice/stack_1", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_5/conv1d", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_5/conv1d/ExpandDims", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_5/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "Identity_8", "op": "Identity", "input": ["StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_5/strided_slice", "^Func/StatefulPartitionedCall/output_control_node/_43"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/conv1d", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/conv1d/ExpandDims", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "Identity_7", "op": "Identity", "input": ["StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/strided_slice", "^Func/StatefulPartitionedCall/output_control_node/_43"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_3/conv1d", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_3/conv1d/ExpandDims", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_3/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "Identity_6", "op": "Identity", "input": ["StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_3/strided_slice", "^Func/StatefulPartitionedCall/output_control_node/_43"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_5/conv1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_5/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/conv1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_3/conv1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_3/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_5/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_5/conv1d/Squeeze", "StatefulPartitionedCall/model/qrnn_0/normalization_2/moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_4/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/conv1d/Squeeze", "StatefulPartitionedCall/model/qrnn_0/normalization_2/moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_3/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_3/conv1d/Squeeze", "StatefulPartitionedCall/model/qrnn_0/normalization_2/moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_5/sub", "op": "Sub", "input": ["StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_5/conv1d/Squeeze", "StatefulPartitionedCall/model/qrnn_1/normalization_5/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_5/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model/qrnn_1/normalization_5/moments/mean", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_5/conv1d/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_4/sub", "op": "Sub", "input": ["StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/conv1d/Squeeze", "StatefulPartitionedCall/model/qrnn_1/normalization_4/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_4/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model/qrnn_1/normalization_4/moments/mean", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_4/conv1d/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_3/sub", "op": "Sub", "input": ["StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_3/conv1d/Squeeze", "StatefulPartitionedCall/model/qrnn_1/normalization_3/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_3/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model/qrnn_1/normalization_3/moments/mean", "StatefulPartitionedCall/model/qrnn_1/temporal_conv1d_3/conv1d/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_5/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/model/qrnn_1/normalization_5/moments/SquaredDifference", "StatefulPartitionedCall/model/qrnn_0/normalization_2/moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_4/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/model/qrnn_1/normalization_4/moments/SquaredDifference", "StatefulPartitionedCall/model/qrnn_0/normalization_2/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_3/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/model/qrnn_1/normalization_3/moments/SquaredDifference", "StatefulPartitionedCall/model/qrnn_0/normalization_2/moments/mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_5/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization_2/add/y", "StatefulPartitionedCall/model/qrnn_1/normalization_5/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_4/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization_2/add/y", "StatefulPartitionedCall/model/qrnn_1/normalization_4/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_3/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/qrnn_0/normalization_2/add/y", "StatefulPartitionedCall/model/qrnn_1/normalization_3/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_5/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model/qrnn_1/normalization_5/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_4/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model/qrnn_1/normalization_4/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_3/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model/qrnn_1/normalization_3/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_5/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_1/normalization_5/ReadVariableOp", "StatefulPartitionedCall/model/qrnn_1/normalization_5/Sqrt"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_4/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_1/normalization_4/ReadVariableOp", "StatefulPartitionedCall/model/qrnn_1/normalization_4/Sqrt"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_3/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_1/normalization_3/ReadVariableOp", "StatefulPartitionedCall/model/qrnn_1/normalization_3/Sqrt"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_5/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_1/normalization_5/sub", "StatefulPartitionedCall/model/qrnn_1/normalization_5/truediv"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_1/normalization_4/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_1/normalization_4/sub", "StatefulPartitionedCall/model/qrnn_1/normalization_4/truediv"], "attr": {"_grappler_ArithmeticOptimizer_MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": 