{"format": "graph-model", "generatedBy": "2.1.0", "convertedBy": "TensorFlow.js Converter v1.4.0", "userDefinedMetadata": {"signature": {"inputs": {"po_0:0": {"name": "po_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "99"}]}}, "c0_0:0": {"name": "c0_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}]}}, "cond:0": {"name": "cond:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4"}]}}, "pf_0:0": {"name": "pf_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "99"}]}}, "h0_0:0": {"name": "h0_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}]}}, "pi_0:0": {"name": "pi_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "99"}]}}, "seq:0": {"name": "seq:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "pz_0:0": {"name": "pz_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "99"}]}}}, "outputs": {"Identity_6:0": {"name": "Identity_6:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "99"}]}}, "Identity_3:0": {"name": "Identity_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "99"}]}}, "Identity_5:0": {"name": "Identity_5:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}]}}, "Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "99"}]}}, "Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "99"}]}}, "Identity_4:0": {"name": "Identity_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "99"}]}}}}}, "modelTopology": {"node": [{"name": "h0_0", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "512"}]}}}}, {"name": "pf_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "99"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pz_0", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "99"}]}}}}, {"name": "cond", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}}, {"name": "c0_0", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "512"}]}}}}, {"name": "pi_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "99"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "seq", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "po_0", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}, {"size": "99"}]}}}}, {"name": "Func/StatefulPartitionedCall/input_control_node/_0", "op": "NoOp", "input": ["^c0_0", "^cond", "^h0_0", "^pf_0", "^pi_0", "^po_0", "^pz_0", "^seq"]}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/ExpandDims/dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/mul/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sum/reduction_indices", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/one_hot/one_hot/depth", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/one_hot/one_hot/on_value", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/one_hot/one_hot/off_value", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "99"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/mul_1/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/mul/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "99"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/mul_1/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/mul/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "99"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/mul_1/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization/mul/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/conv1d/ExpandDims_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "99"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization/mul_1/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/free", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/axes", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/concat/axis", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "99"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Const_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "99"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/ExpandDims", "op": "ExpandDims", "input": ["cond", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/ifo_0/ExpandDims", "op": "ExpandDims", "input": ["c0_0", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sum/reduction_indices"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/one_hot/one_hot", "op": "OneHot", "input": ["seq", "StatefulPartitionedCall/model/one_hot/one_hot/depth", "StatefulPartitionedCall/model/one_hot/one_hot/on_value", "StatefulPartitionedCall/model/one_hot/one_hot/off_value"], "attr": {"T": {"type": "DT_FLOAT"}, "TI": {"type": "DT_INT32"}, "axis": {"i": "-1"}}}, {"name": "Func/StatefulPartitionedCall/output_control_node/_30", "op": "NoOp", "input": ["^StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/dense/Tensordot/ReadVariableOp", "^StatefulPartitionedCall/model/qrnn_0/conditional_normalization/mul/ReadVariableOp", "^StatefulPartitionedCall/model/qrnn_0/conditional_normalization/mul_1/ReadVariableOp", "^StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/mul/ReadVariableOp", "^StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/mul_1/ReadVariableOp", "^StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/mul/ReadVariableOp", "^StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/mul_1/ReadVariableOp", "^StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/mul/ReadVariableOp", "^StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/mul_1/ReadVariableOp"]}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/ExpandDims", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/mul/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/ExpandDims", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/mul_1/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/mul/ReadVariableOp", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/ExpandDims"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/mul_1/ReadVariableOp", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/ExpandDims"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/ExpandDims", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/mul/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/ExpandDims", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/mul_1/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization/mul/ReadVariableOp", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/ExpandDims"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization/mul_1/ReadVariableOp", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/ExpandDims"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/concat", "op": "ConcatV2", "input": ["po_0", "StatefulPartitionedCall/model/one_hot/one_hot", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/concat", "op": "ConcatV2", "input": ["pf_0", "StatefulPartitionedCall/model/one_hot/one_hot", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/concat", "op": "ConcatV2", "input": ["pi_0", "StatefulPartitionedCall/model/one_hot/one_hot", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/concat", "op": "ConcatV2", "input": ["pz_0", "StatefulPartitionedCall/model/one_hot/one_hot", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/mul", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sum_1", "op": "Sum", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/mul_1", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/mul", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/Sum_1", "op": "Sum", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/mul_1", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/mul", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/Sum_1", "op": "Sum", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/mul_1", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization/mul", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization/Sum_1", "op": "Sum", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization/mul_1", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/concat", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/concat", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/strided_slice/stack", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/strided_slice/stack_1", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/strided_slice/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/concat", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sum/reduction_indices"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/concat", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/strided_slice/stack", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/strided_slice/stack_1", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/concat", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sum/reduction_indices"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/concat", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/strided_slice/stack", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/strided_slice/stack_1", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/concat", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sum/reduction_indices"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/concat", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/strided_slice/stack", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/strided_slice/stack_1", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/conv1d", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/conv1d/ExpandDims", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "Identity_3", "op": "Identity", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/strided_slice", "^Func/StatefulPartitionedCall/output_control_node/_30"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/conv1d", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/conv1d/ExpandDims", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "Identity_2", "op": "Identity", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/strided_slice", "^Func/StatefulPartitionedCall/output_control_node/_30"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/conv1d", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/conv1d/ExpandDims", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Identity_4", "op": "Identity", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/strided_slice", "^Func/StatefulPartitionedCall/output_control_node/_30"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/conv1d", "op": "Conv2D", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/conv1d/ExpandDims", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/strided_slice", "^Func/StatefulPartitionedCall/output_control_node/_30"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/conv1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/conv1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/conv1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/conv1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/conv1d/Squeeze", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/conv1d/Squeeze", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/ExpandDims/dim"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/conv1d/Squeeze", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/conv1d/Squeeze", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/ExpandDims/dim"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/sub", "op": "Sub", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/conv1d/Squeeze", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/moments/mean", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/conv1d/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/sub", "op": "Sub", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/conv1d/Squeeze", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/moments/mean", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/conv1d/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/moments/mean", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/conv1d/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/sub", "op": "Sub", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/conv1d/Squeeze", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization/sub", "op": "Sub", "input": ["StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/conv1d/Squeeze", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization/moments/mean", "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/conv1d/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/moments/SquaredDifference", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/ExpandDims/dim"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/moments/SquaredDifference", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/ExpandDims/dim"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/moments/SquaredDifference", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization/moments/SquaredDifference", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/add/y", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/moments/variance", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/add/y", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/moments/variance"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization/moments/variance", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization/Sqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sqrt", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/Sqrt", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/Sqrt", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization/Sqrt", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sum", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/Sum", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/Sum", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization/Sum", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sum_1", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/Sum_1", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/Sum_1", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization/Sum_1", "StatefulPartitionedCall/model/qrnn_0/conditional_normalization/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/model/qrnn_0/conditional_normalization/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/ifo_0/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/Sigmoid", "StatefulPartitionedCall/model/qrnn_0/ifo_0/ExpandDims"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/ifo_0/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/Sigmoid_2", "StatefulPartitionedCall/model/qrnn_0/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/ifo_0/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/qrnn_0/ifo_0/mul", "StatefulPartitionedCall/model/qrnn_0/ifo_0/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/ifo_0/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/model/qrnn_0/Sigmoid_1", "StatefulPartitionedCall/model/qrnn_0/ifo_0/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/ifo_0/Squeeze_1", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/qrnn_0/ifo_0/add"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/qrnn_0/ifo_0/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/qrnn_0/ifo_0/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/qrnn_0/ifo_0/mul_2"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity_6", "op": "Identity", "input": ["StatefulPartitionedCall/model/qrnn_0/ifo_0/Squeeze_1", "^Func/StatefulPartitionedCall/output_control_node/_30"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/dense/Tensordot/Shape", "StatefulPartitionedCall/model/dense/Tensordot/free", "StatefulPartitionedCall/model/dense/Tensordot/concat/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/dense/Tensordot/Shape", "StatefulPartitionedCall/model/dense/Tensordot/axes", "StatefulPartitionedCall/model/dense/Tensordot/concat/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "Identity_5", "op": "Identity", "input": ["StatefulPartitionedCall/model/qrnn_0/ifo_0/Squeeze", "^Func/StatefulPartitionedCall/output_control_node/_30"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/model/dense/Tensordot/GatherV2", "StatefulPartitionedCall/model/dense/Tensordot/Const"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model/dense/Tensordot/GatherV2", "StatefulPartitionedCall/model/dense/Tensordot/Const_2", "StatefulPartitionedCall/model/dense/Tensordot/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/model/dense/Tensordot/GatherV2_1", "StatefulPartitionedCall/model/dense/Tensordot/Const"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model/dense/Tensordot/Prod", "StatefulPartitionedCall/model/dense/Tensordot/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/qrnn_0/ifo_0/mul_2", "StatefulPartitionedCall/model/dense/Tensordot/stack"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model/dense/Tensordot/Reshape", "StatefulPartitionedCall/model/dense/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model/dense/Tensordot/MatMul", "StatefulPartitionedCall/model/dense/Tensordot/concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/dense/Tensordot", "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/dense/BiasAdd", "^Func/StatefulPartitionedCall/output_control_node/_30"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {"producer": 134}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/mul/ReadVariableOp", "shape": [4, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/Sum/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/one_hot/one_hot/depth", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/one_hot/one_hot/on_value", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/one_hot/one_hot/off_value", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_2/conv1d/ExpandDims_1", "shape": [1, 4, 99, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/add/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_2/mul_1/ReadVariableOp", "shape": [4, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/mul/ReadVariableOp", "shape": [4, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_1/conv1d/ExpandDims_1", "shape": [1, 4, 99, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_1/mul_1/ReadVariableOp", "shape": [4, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/mul/ReadVariableOp", "shape": [4, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/conv1d/ExpandDims_1", "shape": [1, 4, 99, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization_3/mul_1/ReadVariableOp", "shape": [4, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization/mul/ReadVariableOp", "shape": [4, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d/conv1d/ExpandDims_1", "shape": [1, 4, 99, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/qrnn_0/conditional_normalization/mul_1/ReadVariableOp", "shape": [4, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/ReadVariableOp", "shape": [512, 99], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "shape": [99], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/strided_slice/stack", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/strided_slice/stack_1", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/qrnn_0/temporal_conv1d_3/strided_slice/stack_2", "shape": [3], "dtype": "int32"}]}]}